In [7]:
import numpy as np
import pandas as pd

In [8]:
#indices com multi nível
#leitura de json ou arquivos que tenham níveis e subníveis

In [9]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]

In [10]:
hier_index = list(zip(outside,inside))

In [11]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [12]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [17]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index,columns=['col_A','col_B'])

In [18]:
df

         col_A     col_B
G1 1 -0.088872 -0.779435
   2 -1.838779  0.363302
   3 -2.709364  0.345854
G2 1  1.069957  1.902034
   2  0.817802  1.101907
   3 -1.367228 -0.815974

In [19]:
df.loc['G1']

      col_A     col_B
1 -0.088872 -0.779435
2 -1.838779  0.363302
3 -2.709364  0.345854

In [21]:
df.loc['G1'].loc[1]

col_A   -0.088872
col_B   -0.779435
Name: 1, dtype: float64

In [23]:
df.index.names = ['Grupo','id']

In [24]:
df

             col_A     col_B
Grupo id
G1    1  -0.088872 -0.779435
      2  -1.838779  0.363302
      3  -2.709364  0.345854
G2    1   1.069957  1.902034
      2   0.817802  1.101907
      3  -1.367228 -0.815974

In [ ]:
#

In [27]:
df.xs('G1')

       col_A     col_B
id
1  -0.088872 -0.779435
2  -1.838779  0.363302
3  -2.709364  0.345854

In [28]:
df.xs(1,level='id')

          col_A     col_B
Grupo
G1    -0.088872 -0.779435
G2     1.069957  1.902034

In [29]:
#dados ausentes

In [30]:
#tratar o NAN

In [34]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [35]:
df = pd.DataFrame(d)

In [36]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
#exclui as linhas que contenho NaN
df.dropna()

     A    B  C
0  1.0  5.0  1

In [50]:
#substinui o NaN por algo conveniente
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [51]:
df.fillna('Ausente')

         A        B  C
0        1        5  1
1        2  Ausente  2
2  Ausente  Ausente  3

In [53]:
#preencher nulos com a média da coluna
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [57]:
#preencher os nulos com o valor anterior
df.fillna(method='ffill')

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [59]:
#groupby

A    1.5
B    5.0
C    2.0
dtype: float64

In [67]:
valores = {
    'especies' : ['versicolor','setosa','virginica','versicolor','setosa','virginica','versicolor','setosa','virginica']
    ,'petala' : [1,2,3,2,3,1,2,3,4]
    ,'sepala' : [4,5,6,5,7,5,3,4,5]
}

In [68]:
df = pd.DataFrame(valores)

In [69]:
df

     especies  petala  sepala
0  versicolor       1       4
1      setosa       2       5
2   virginica       3       6
3  versicolor       2       5
4      setosa       3       7
5   virginica       1       5
6  versicolor       2       3
7      setosa       3       4
8   virginica       4       5

In [70]:
agrupado = df.groupby('especies')

In [72]:
agrupado.sum()

            petala  sepala
especies
setosa           8      16
versicolor       5      12
virginica        8      16

In [73]:
agrupado.mean()

              petala    sepala
especies
setosa      2.666667  5.333333
versicolor  1.666667  4.000000
virginica   2.666667  5.333333

In [77]:
df_iris = pd.read_csv('iris.csv',sep=';')

In [82]:
df_iris.groupby('Especie').mean()

,Id,Comprimento_Sepala,Largura_Sepala,Comprimento_Petala,Largura_Petala
Especie,,,,,
setosa,25.5,5.006,3.418,1.464,0.244
versicolor,75.5,5.936,2.770,4.260,1.326
virginica,125.5,6.588,2.974,5.552,2.026

In [85]:
df_iris.groupby('Especie').describe()

              Id                                                        \
           count   mean       std    min     25%    50%     75%    max
Especie
setosa      50.0   25.5  14.57738    1.0   13.25   25.5   37.75   50.0
versicolor  50.0   75.5  14.57738   51.0   63.25   75.5   87.75  100.0
virginica   50.0  125.5  14.57738  101.0  113.25  125.5  137.75  150.0

           Comprimento_Sepala         ... Comprimento_Petala       \
                        count   mean  ...                75%  max
Especie                               ...
setosa                   50.0  5.006  ...              1.575  1.9
versicolor               50.0  5.936  ...              4.600  5.1
virginica                50.0  6.588  ...              5.875  6.9

           Largura_Petala
                    count   mean       std  min  25%  50%  75%  max
Especie
setosa               50.0  0.244  0.107210  0.1  0.2  0.2  0.3  0.6
versicolor           50.0  1.326  0.197753  1.0  1.2  1.3  1.5  1.8
virginica            50.0  2.026  0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 40 columns]